app/views/comments/_comment.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."noticia_id" = 1 ORDER BY id ASC
---
    <%unless comment.persona.id != session[:usuario_id]%>
        <a href="#" class="delete_comment" onclick='$.get("/comments/<%=comment.id%>/delete/<%=comment.noticia_id%>", null,
                    function(data){
                        $("#comment_<%=comment.id%>").hide("scale",{duration: 3000});
                    });