app/views/comments/_comment.html.erb

SELECT `personas`.* FROM `personas` WHERE `personas`.`id` = 1 LIMIT 1
---
<%= div_for comment do %>
	<%usuario = Persona.find(comment.usuario_id)%>

UPDATE "comments" SET "cuerpo" = 'Puto', "updated_at" = '2014-07-05 01:01:55.779606' WHERE "comments"."id" = 9
---
    <p class="fecha">
        <%=time_ago_in_words(comment.updated_at).capitalize + "."%>