app/views/admin/index.html.erb

SELECT COUNT(*) FROM `noticia` WHERE (created_at >= '2015-04-24 00:37:50' AND created_at < '2015-05-24 00:37:50')
---
        function drawChart() {
            var data = google.visualization.arrayToDataTable([
                ['', 'Noticias'],
                ['1 estrellas',   <%=@estrella1.to_a.size%>],
                ['2 estrellas',   <%=@estrella2.to_a.size %>],
                ['3 estrellas',   <%=@estrella3.to_a.size %>]
            ]);