app/views/notifications/_mis_notifications.html.erb

            <%
            @noticium = Noticium.find(noti.noticia_id)
---
SELECT "noticia".* FROM "noticia" WHERE "noticia"."id" = 2 LIMIT 1