app/views/notifications/_notification.html.erb

        <%
        noticia = Noticium.find(notification.noticia_id)
---
SELECT "noticia".* FROM "noticia" WHERE "noticia"."id" = $1 LIMIT 1  [["id", 2]]