app/views/inicio/start.html.erb

SELECT `personas`.* FROM `personas` WHERE `personas`.`id` = 1 LIMIT 1
---
      </nav>
      <a href="mi_pajaro/<%= @persona.id %>"><img src=<%= Persona.find(session[:usuario_id]).genero ? '/picture/hombre.png' : '/picture/mujer.png' %> src=""