app/views/imagens/mis_imagenes.html.erb

                    </nav>
                  <% @persona = Persona.find(session[:usuario_id]) %>
---
SELECT `personas`.* FROM `personas` WHERE `personas`.`id` = 1 LIMIT 1