app/views/personas/show.erb

SELECT "personas".* FROM "personas" WHERE "personas"."id" = $1 LIMIT 1  [["id", "6"]]
---
        </nav>
        <img src=<%= Persona.find(session[:usuario_id]).genero ? '/picture/hombre.png' : '/picture/mujer.png' %> src="" id="fotoPerfil" >