app/views/noticia/new.html.erb

SELECT `personas`.* FROM `personas` WHERE `personas`.`id` = 1 LIMIT 1
---
                    </nav>
                    <%= @persona = Persona.find(session[:usuario_id]) %>