app/views/noticia/show.html.erb

            <%= simple_format @noticium.cuerpo %>
            <%if Persona.find(session[:usuario_id]).admin || session[:usuario_id] == @noticium.persona.id %>
---
SELECT "personas".* FROM "personas" WHERE "personas"."id" = 4 LIMIT 1