app/controllers/admin_controller.rb

SELECT `personas`.* FROM `personas`
SELECT COUNT(*) FROM "personas" WHERE (genero = 'f')
SELECT COUNT(*) FROM "personas" WHERE "personas"."bloqueado" = 't'
SELECT COUNT(*) FROM "personas" WHERE "personas"."activo" = 't' AND (created_at >= '2014-07-05 13:17:44.934931' AND created_at < '2014-08-05 13:17:44.935172')
---
  def index
    @all_personas = Persona.all

    @usu_gen_f = Persona.where("genero = ?", false).count.to_s
    @usu_gen_m = Persona.where("genero = ?", true).count.to_s
    @usu_gen_t = @usu_gen_f.to_i + @usu_gen_m.to_i


    @usu_act_bloq = Persona.bloqueado.count.to_s
    @usu_act_no_bloq = (@all_personas.count.to_i - @usu_act_bloq.to_i).to_s

    @usu_act = Persona.activo.count.to_s

SELECT consulta.id FROM (SELECT cast(cast((sum(public.calificacions.valor)) as float)/count(*)as float) promedio, noticia_id id FROM "calificacions" INNER JOIN "noticia" ON "calificacions"."noticia_id" = "noticia"."id" GROUP BY "calificacions"."noticia_id") as consulta WHERE consulta.promedio >= 1.5 and consulta.promedio < 2.5
---

    calificacions = Arel::Table.new(:calificacions)
    noticia = Arel::Table.new(:noticia)
    resultado = calificacions
    .join(noticia)
    .on(calificacions[:noticia_id]
        .eq(noticia[:id]))
    .project(Arel.sql('cast(cast((sum(public.calificacions.valor)) as float)/count(*)as float) promedio, noticia_id id'))
    .group(calificacions[:noticia_id])

SELECT COUNT(*) FROM "imagens" WHERE (created_at >= '2014-07-05 13:17:45.001545' AND created_at < '2014-08-05 13:17:45.001697')
---
    @Progreso_img = Array.new(12)

    (0..12).to_a.each do |i|
      @Progreso_img[i] = Imagen.where(
          'created_at >= :inicio AND created_at < :fin',
          inicio: i.month.ago, fin: (i-1).month.ago
      ).count

SELECT COUNT(*) FROM "videos" WHERE (created_at >= '2014-07-05 13:17:45.022163' AND created_at < '2014-08-05 13:17:45.022346')
---
    @Progreso_vid = Array.new(12)

    (0..12).to_a.each do |i|
      @Progreso_vid[i] = Video.where(
          'created_at >= :inicio AND created_at < :fin',
          inicio: i.month.ago, fin: (i-1).month.ago
      ).count

SELECT `personas`.* FROM `personas` ORDER BY id ASC LIMIT 10 OFFSET 0
SELECT "personas".* FROM "personas" WHERE (lower("nombre") LIKE '%javier%%' AND lower("apellido") LIKE '%%' AND lower("username") LIKE '%%' AND lower("email") LIKE '%%' AND activo = 'f' AND bloqueado = 'f' AND admin = 'f') ORDER BY id ASC LIMIT 10 OFFSET 0
---
  def user


      if params[:act].to_s == "true"
        act = TRUE
      else
        act = FALSE
      end

      if params[:bloq].to_s == "true"
        bloq = TRUE
      else
        bloq = FALSE
      end

      if params[:admin].to_s == "true"
        admin = TRUE
      else
        admin = FALSE
      end


      if params[:act].nil?
          @usuarios = Persona.order('id ASC').paginate(:page => params[:page], :per_page => 10)
      else
        @usuarios = Persona.where(
            'lower("nombre") LIKE :nom AND lower("apellido") LIKE :ape AND lower("username") LIKE :user AND lower("email") LIKE :mail AND activo = :act AND bloqueado = :bloq AND admin = :admin',
            nom: '%'+params[:nom].to_s.downcase+'%', ape: '%'+params[:ape].to_s.downcase+'%', user: '%'+params[:user].to_s.downcase+'%', mail: '%'+params[:mail].to_s.downcase+'%', act: act, bloq: bloq, admin: admin
        ).order('id ASC').paginate(:page => params[:page], :per_page => 10)

SELECT `personas`.* FROM `personas` WHERE `personas`.`id` = 1 LIMIT 1
SELECT `roles`.* FROM `roles` ORDER BY name ASC
SELECT COUNT(*) FROM "imagens" WHERE (created_at >= '2014-08-24 16:20:01.801014' AND created_at < '2014-09-24 16:20:01.801223' AND persona_id = 1)
---
  def user_edit
    @usuario = Persona.find params[:id]
    @roles = Role.order('name ASC')
    @year_fin = Date.today.year
    @year_inicio = @year_fin - 100
    @etiqueta = (0..12).to_a
    @etiqueta.to_a.reverse!

    @Progreso_not = Array.new(12)

    (0..12).to_a.each do |i|
      @Progreso_not[i] = Noticium.where(
          'created_at >= :inicio AND created_at < :fin AND persona_id = :persona_id',
          inicio: i.month.ago, fin: (i-1).month.ago, persona_id: @usuario.id
      ).count
    end
    @Progreso_not.delete_at 0
    @Progreso_not.reverse!

    @Progreso_img = Array.new(12)

    (0..12).to_a.each do |i|
      @Progreso_img[i] = Imagen.where(
          'created_at >= :inicio AND created_at < :fin AND persona_id = :persona_id',
          inicio: i.month.ago, fin: (i-1).month.ago, persona_id: @usuario.id
      ).count

SELECT COUNT(*) FROM "videos" WHERE (created_at >= '2014-08-24 16:20:01.829463' AND created_at < '2014-09-24 16:20:01.829620' AND persona_id = 1)
---
    @Progreso_vid = Array.new(12)

    (0..12).to_a.each do |i|
      @Progreso_vid[i] = Video.where(
          'created_at >= :inicio AND created_at < :fin AND persona_id = :persona_id',
          inicio: i.month.ago, fin: (i-1).month.ago, persona_id: @usuario.id
      ).count

SELECT "personas".* FROM "personas" WHERE "personas"."id" = 1 LIMIT 1
---
  def change_atributo
    @persona = Persona.find params[:id]