app/controllers/calificacions_controller.rb

INSERT INTO "calificacions" ("created_at", "noticia_id", "persona_id", "updated_at", "valor") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Fri, 04 Jul 2014 22:10:25 UTC +00:00], ["noticia_id", 2], ["persona_id", 1], ["updated_at", Fri, 04 Jul 2014 22:10:25 UTC +00:00], ["valor", 2]]
SELECT "calificacions".* FROM "calificacions" WHERE (noticia_id = '2')
---
  def create
    @calificacion = Calificacion.new
    @calificacion.persona_id = session[:usuario_id]
    @calificacion.noticia_id = params[:noticia]
    @calificacion.valor = params[:valor]
    @calificacion.save
    calificaciones = Calificacion.where("noticia_id = ?",params[:noticia])