app/controllers/comments_controller.rb

SELECT "noticia".* FROM "noticia" WHERE "noticia"."id" = $1 LIMIT 1  [["id", "2"]]
SELECT `personas`.* FROM `personas` WHERE `personas`.`id` = 1 LIMIT 1
INSERT INTO "comments" ("created_at", "cuerpo", "edited", "noticia_id", "persona_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Fri, 04 Jul 2014 21:51:44 UTC +00:00], ["cuerpo", "Hola"], ["edited", false], ["noticia_id", 2], ["persona_id", 1], ["updated_at", Fri, 04 Jul 2014 21:51:44 UTC +00:00]]
SELECT "personas".* FROM "personas" INNER JOIN "comments" ON "comments"."persona_id" = "personas"."id" WHERE "personas"."activo" = 't' AND "comments"."noticia_id" = 2 AND (personas.id <> '1')
SELECT DISTINCT "personas".* FROM "personas" INNER JOIN "comments" ON "comments"."persona_id" = "personas"."id" WHERE "personas"."activo" = 't' AND "comments"."noticia_id" = 2 AND (personas.id <> '1')
SELECT "notifications".* FROM "notifications" WHERE (noticia_id = '2' AND read = 'f' AND persona_id = 1)
SELECT COUNT(*) FROM "notifications" WHERE (noticia_id = '2' AND read = 'f' AND persona_id = 1)
INSERT INTO "notifications" ("created_at", "mensaje", "noticia_id", "persona_id", "read", "updated_at", "usuarios") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    url = "/noticias/" + params[:noticia].to_s
    if params[:text_area_comment].size > 0
      @comment = Comment.new
      usuario_id = params[:usuario]
      @comment.persona_id = usuario_id
      @comment.noticia_id = params[:noticia]
      @comment.cuerpo = params[:text_area_comment]
      noticia = Noticium.find params[:noticia]
      comentarista = Persona.find(usuario_id)

      if @comment.save
        #Crear Notificaciones
        @personas = Persona.activo.where(['personas.id <> ?', params[:usuario]]).joins(:comments).where(comments: {noticia_id: params[:noticia]})

          @personas.uniq.each do |p|
    	        @notifications = Notification.where("noticia_id = ? AND read = ? AND persona_id = ?",params[:noticia], false, p.id)
      	      if @notifications.size > 0
    	          @notifications.at(0).actualizar_notificacion comentarista.nombre + " " + comentarista.apellido unless @notifications.at(0).nil?
      	      else
    	          notificacion = Notification.new
         	      notificacion.read = false
          	    notificacion.noticia_id = noticia.id
          	    notificacion.mensaje = noticia.titulo
          	    notificacion.persona_id = p.id
          	    notificacion.usuarios = comentarista.nombre + " " + comentarista.apellido
                notificacion.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", "9"]]
UPDATE "comments" SET "cuerpo" = 'Puto', "updated_at" = '2014-07-05 01:01:55.779606' WHERE "comments"."id" = 9
---
  def update
    @comment = Comment.find(params[:id])
    @comment.update_attributes(:cuerpo => params[:cuerpo])

SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 1
---
  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy