app/controllers/functions_controller.rb

SELECT COUNT(*) FROM `functions`
SELECT `functions`.* FROM `functions` ORDER BY name ASC LIMIT 10 OFFSET 0
---
  def index
    @functions = Functions.order('name ASC').paginate(:page => params[:page], :per_page => 10)

INSERT INTO `functions` (`name`) VALUES ('1sdfsdfsdf')
---
  def create
    @function = Functions.new()
    @function.name = params[:name]
    @function.save

SELECT `functions`.* FROM `functions` WHERE `functions`.`id` = 24 LIMIT 1
DELETE FROM `functions` WHERE `functions`.`id` = 24
---
  def destroy
    @function = Functions.find(params[:id])
    @function.destroy