app/controllers/imagens_controller.rb

SELECT `notifications`.* FROM `notifications` WHERE (`read` = 0 AND persona_id = 1)
SELECT `imagens`.* FROM `imagens` ORDER BY id DESC LIMIT 21 OFFSET 0
---
  def index
    @notificaciones = Notification.where("read = ? AND persona_id = ?", false, session[:usuario_id])
    @imagens = Imagen.order('id DESC').paginate(:page => params[:page], :per_page => 21)

SELECT `notifications`.* FROM `notifications` WHERE (`read` = 0 AND persona_id = 1)
SELECT `imagens`.* FROM `imagens` WHERE `imagens`.`persona_id` = 1 ORDER BY id DESC LIMIT 21 OFFSET 0
---
  def mis_imagenes
    @notificaciones = Notification.where("read = ? AND persona_id = ?", false, session[:usuario_id])
    @imagens = Imagen.where(persona_id: session[:usuario_id]).order('id DESC').paginate(:page => params[:page], :per_page => 21)

INSERT INTO `imagens` (`created_at`, `persona_id`, `picasa_id`, `updated_at`, `url`) VALUES ('2016-02-24 01:14:45', 1, '24856782099', '2016-02-24 01:14:45', 'https://farm2.staticflickr.com/1446/24856782099_d20f2f7b67_b.jpg')
---
  def create
    @imagen = Imagen.new()
    @imagen.persona_id = session[:usuario_id]
    if params[:picture].nil?
	    redirect_to "/imagenes", alert: "seleccione una imagen antes de guardar."
   else
     flickr_id = Flickrphoto.new.subir_imagen params[:picture]
     if flickr_id.nil?
	    redirect_to "/imagenes", alert: "Error al guardar"
     else
	     @imagen.url = Flickrphoto.new.get_url_flickr flickr_id
	     @imagen.picasa_id = flickr_id
	      respond_to do |format|
      		if @imagen.save

SELECT "imagens".* FROM "imagens" WHERE "imagens"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "imagens" WHERE "imagens"."id" = $1  [["id", 1]]
---
  def destroy
    @imagen = Imagen.find(params[:id])
    if @imagen.persona.id = session[:usuario_id]
      @imagen.destroy