app/controllers/noticia_controller.rb

  def index
    if params[:search].nil?
      @noticia = Noticium.order('id DESC').paginate(:page => params[:page], :per_page => 8)
    else
      if params[:search].to_s.size > 0
        @noticia = Noticium.search(params[:search]).order('id DESC').paginate(:page => params[:page], :per_page => 8)
      else
        @noticia = Noticium.order('id DESC').paginate(:page => params[:page], :per_page => 8)
      end
      @noticia = Noticium.search(params[:search]).order('id DESC').paginate(:page => params[:page], :per_page => 8)
    end
    @notificaciones = Notification.where("`read` = ? AND persona_id = ?", false, session[:usuario_id])
---
SELECT `notifications`.* FROM `notifications` WHERE (`read` = 0 AND persona_id = 1)

  def mis_noticias
    @notificaciones = Notification.where("`read` = ? AND persona_id = ?", false, session[:usuario_id])
---
SELECT `notifications`.* FROM `notifications` WHERE (`read` = 0 AND persona_id = 1)

  def show
    @usuario_id = session[:usuario_id]
    @noticium = Noticium.find(params[:id])
    @comentarios = Comment.where(noticia_id: @noticium.id).order('id ASC')
    @notificaciones = Notification.where("`read` = ? AND persona_id = ? AND noticia_id = ?", false, session[:usuario_id],params[:id])
    @notificaciones.each do |n|
      n.mark_as_read
    end
    @total = 0
    @califico = true
    @notificaciones = Notification.where("`read` = ? AND persona_id = ?", false, session[:usuario_id])

    if @noticium.persona_id != @usuario_id
      @califico = (Calificacion.where("noticia_id = ? AND persona_id = ?",params[:id], session[:usuario_id]).size > 0)
---
SELECT "comments".* FROM "comments" WHERE "comments"."noticia_id" = 1 ORDER BY id ASC
SELECT `notifications`.* FROM `notifications` WHERE (`read` = 0 AND persona_id = 1 AND noticia_id = '1')
SELECT COUNT(*) FROM "calificacions" WHERE (noticia_id = '2' AND persona_id = 1)
SELECT `calificacions`.* FROM `calificacions` WHERE (noticia_id = '1')

  def new
    @notificaciones = Notification.where("`read` = ? AND persona_id = ?", false, session[:usuario_id])
    @persona = Persona.find(session[:usuario_id])
---
SELECT `notifications`.* FROM `notifications` WHERE (`read` = 0 AND persona_id = 1)
SELECT `personas`.* FROM `personas` WHERE `personas`.`id` = 1 LIMIT 1

  def edit
    @notificaciones = Notification.where("`read` = ? AND persona_id = ?", false, session[:usuario_id])
    @noticium = Noticium.find(params[:id])
    @persona = Persona.find(session[:usuario_id])
---
SELECT `notifications`.* FROM `notifications` WHERE (`read` = 0 AND persona_id = 1)
SELECT `personas`.* FROM `personas` WHERE `personas`.`id` = 1 LIMIT 1

  def create
    @persona = Persona.find(session[:usuario_id])
    @noticium = Noticium.new()
    @noticium.titulo = params[:titulo]
    @noticium.cuerpo = params[:cuerpo]
    @noticium.persona=  @persona
    unless params[:picture].nil?
      @imagen = Imagen.new()
      @imagen.persona=@persona
      flickr_id = Flickrphoto.new.subir_imagen params[:picture]
       if flickr_id.nil?
         @noticium.imagen = nil
       else
         @imagen.url = Flickrphoto.new.get_url_flickr flickr_id
         @imagen.picasa_id = flickr_id
         @imagen.save
---
SELECT `personas`.* FROM `personas` WHERE `personas`.`id` = 1 LIMIT 1
INSERT INTO `imagens` (`created_at`, `persona_id`, `picasa_id`, `updated_at`, `url`) VALUES ('2016-02-24 01:08:47', 1, '25224398055', '2016-02-24 01:08:47', 'https://farm2.staticflickr.com/1589/25224398055_d98367eaba_b.jpg')

  def update
    @noticium = Noticium.find(params[:id])
    @persona = Persona.find(session[:usuario_id])
    if Permissions.permiso(@persona.id,'Editar Noticias') || @noticium.persona_id.to_s == session[:usuario_id].to_s
      unless params[:picture].nil?

        @imagen = Imagen.new()
        @imagen.persona=@persona
        flickr_id = Flickrphoto.new.subir_imagen params[:picture]
         if flickr_id.nil?
           @noticium.imagen = nil
         else
           @imagen.url = Flickrphoto.new.get_url_flickr flickr_id
           @imagen.picasa_id = flickr_id
           @imagen.save
           @noticium.imagen = @imagen
         end
      end
      respond_to do |format|
        if @noticium.update_attributes(params[:noticium])
---
SELECT `personas`.* FROM `personas` WHERE `personas`.`id` = 1 LIMIT 1
UPDATE "noticia" SET "cuerpo" = 'asdasdasdasd', "updated_at" = '2014-07-05 13:22:24.027395' WHERE "noticia"."id" = 1