app/controllers/notifications_controller.rb

  def index
    @notificaciones = Notification.where("persona_id = ?", session[:usuario_id]).order('id DESC').paginate(:page => params[:page], :per_page => 20)
---
SELECT "notifications".* FROM "notifications" WHERE (persona_id = 1) ORDER BY id DESC LIMIT 20 OFFSET 0

  def nuevas_notificaciones
    @notificaciones = Notification.where("`read` = ? AND persona_id = ?", false, session[:usuario_id]).order('id DESC')
---
SELECT `notifications`.* FROM `notifications` WHERE (`read` = 0 AND persona_id = 1) ORDER BY id DESC