app/controllers/novelties_controller.rb

SELECT `novelties`.* FROM `novelties` ORDER BY id DESC LIMIT 10 OFFSET 0
---
  def index
    @novelties = Novelty.order('id DESC').paginate(:page => params[:page], :per_page => 10)

INSERT INTO `usr_novelties` (`created_at`, `novelty_id`, `persona_id`, `updated_at`, `viewed`) VALUES ('2016-02-24 00:59:20', 1, 1, '2016-02-24 00:59:20', 0)
SELECT `personas`.* FROM `personas`
---
  def create
    @novelty = Novelty.new()
    @novelty.message = params[:message]
    @novelty.save

    @personas = Persona.all

SELECT `novelties`.* FROM `novelties` WHERE `novelties`.`id` = 2 LIMIT 1
UPDATE `novelties` SET `message` = 'asdasdsdasdasdasdasdasd', `updated_at` = '2016-02-24 01:00:04' WHERE `novelties`.`id` = 2
---
  def update
    @novelty = Novelty.find(params[:id])
    @novelty.update_attributes(:message => params[:message])

SELECT `usr_novelties`.* FROM `usr_novelties` WHERE `usr_novelties`.`novelty_id` = 1
DELETE FROM `usr_novelties` WHERE `usr_novelties`.`id` = 1
---
  def destroy
    @novelty = Novelty.find(params[:id])
    @novelty.destroy