app/controllers/permissions_controller.rb

  def index
    @roles = Role.order('name ASC')
    functions = Arel::Table.new(:functions)
    permisos = Arel::Table.new(:permissions)


    @si_funciones = functions.where(functions[:id].in(permisos.where(permisos[:role_id].eq(@roles.first.id)).project(Arel.sql('function_id')))).order('name ASC').project(Arel.sql('*'))
---
SELECT `roles`.* FROM `roles` ORDER BY name ASC LIMIT 1
SELECT * FROM "functions" WHERE "functions"."id" NOT IN (SELECT function_id FROM "permissions" WHERE "permissions"."role_id" = 22) ORDER BY name ASC

  def add_all_function
    functions = Arel::Table.new(:functions)
    permisos = Arel::Table.new(:permissions)
    rol = params[:role]
    @no_funciones = functions.where(functions[:id].not_in(permisos.where(permisos[:role_id].eq(rol)).project(Arel.sql('function_id')))).order('name ASC').project(Arel.sql('*'))
    @no_funciones.to_a.each  do |f|
      p = Permissions.new
      p.role_id = rol
      p.function_id = f.id
      p.save
---
SELECT * FROM `functions` WHERE `functions`.`id` NOT IN (SELECT function_id FROM `permissions` WHERE `permissions`.`role_id` = 1) ORDER BY name ASC
INSERT INTO `permissions` (`function_id`, `role_id`) VALUES (7, 1)

  def add_one_function
    p = Permissions.new
    p.role_id = params[:role]
    p.function_id = params[:function]
    p.save
---
INSERT INTO `permissions` (`function_id`, `role_id`) VALUES (4, 1)

  def remove_one_function
    Permissions.destroy Permissions.where(role_id: params[:role], function_id: params[:function])
---
DELETE FROM "permissions" WHERE "permissions"."id" = $1  [["id", 326]]
SELECT "permissions".* FROM "permissions" WHERE "permissions"."role_id" = 8 AND "permissions"."function_id" = 27

  def change_rol
    rol = params[:role]
    functions = Arel::Table.new(:functions)
    permisos = Arel::Table.new(:permissions)

    @si_funciones = functions.where(functions[:id].in(permisos.where(permisos[:role_id].eq(rol)).project(Arel.sql('function_id')))).order('name ASC').project(Arel.sql('*'))
---
SELECT * FROM "functions" WHERE "functions"."id" NOT IN (SELECT function_id FROM "permissions" WHERE "permissions"."role_id" = 8) ORDER BY name ASC