app/controllers/personas_controller.rb

SELECT "personas".* FROM "personas" WHERE "personas"."id" = 1 LIMIT 1
---
  def destroy
    @administrador = Persona.find(session[:usuario_id])

SELECT "personas".* FROM "personas" WHERE "personas"."id" = $1 LIMIT 1  [["id", "6"]]
---
  def show
    @usuario = Persona.find(params[:id])