app/controllers/videos_controller.rb

  def index
    @persona = Persona.find(session[:usuario_id])
---
SELECT `personas`.* FROM `personas` WHERE `personas`.`id` = 1 LIMIT 1