app/controllers/videos_controller.rb

SELECT `notifications`.* FROM `notifications` WHERE (`read` = 0 AND persona_id = 1)
SELECT `videos`.* FROM `videos` WHERE (titulo LIKE '%sdfsdf%') ORDER BY id DESC LIMIT 5 OFFSET 0
---
  def index
    @notificaciones = Notification.where("`read` = ? AND persona_id = ?", false, session[:usuario_id])

    if params[:search].nil?
      @videos = Video.order('id DESC').paginate(:page => params[:page], :per_page => 5)

SELECT `notifications`.* FROM `notifications` WHERE (`read` = 0 AND persona_id = 1)
SELECT `videos`.* FROM `videos` WHERE `videos`.`persona_id` = 1 ORDER BY id DESC LIMIT 5 OFFSET 0
---
  def mis_videos
    @notificaciones = Notification.where("`read` = ? AND persona_id = ?", false, session[:usuario_id])
    if params[:search].nil?
      @videos = Video.where(persona_id: session[:usuario_id]).order('id DESC').paginate(:page => params[:page], :per_page => 5)

SELECT `notifications`.* FROM `notifications` WHERE (`read` = 0 AND persona_id = 1)
SELECT `personas`.* FROM `personas` WHERE `personas`.`id` = 1 LIMIT 1
---
  def new
    @notificaciones = Notification.where("`read` = ? AND persona_id = ?", false, session[:usuario_id])
    @persona = Persona.find(session[:usuario_id])

SELECT `personas`.* FROM `personas` WHERE `personas`.`id` = 1 LIMIT 1
INSERT INTO `videos` (`created_at`, `persona_id`, `titulo`, `updated_at`, `url`) VALUES ('2016-02-24 01:52:19', 1, 'Asd', '2016-02-24 01:52:19', '//www.youtube.com/embed/EDlC7oG_2W4')
---
  def create

    @video = Video.new(params[:video])
    @video.persona= Persona.find(session[:usuario_id])
    respond_to do |format|
      if @video.save